package lesson_28.nested;

public class NestedExample {
    //nested classes - вложенные - статические классы
    //inner classes - внутренние - локальные (не статические) классы

    /*
    1. статический класс не имеет доступа к членам внешнего класса без явной передачи при помощи методов
    Могут быть использованы независимо от внешнего класса (методы могут быть вызваны без вызова объекта)
    2. Внутренние классы - имеют доступ ко всем полям и методам внешнего класса, даже если они объявлениы private

     */

}
